In [1]:
import numpy as np
import pandas as pd

In [2]:
pd_data = pd.read_csv("yan.csv")

In [3]:
pd_data

          name  age gender  zipcode       phone
0  Tristan Yan    0      M    94566  9253515818
1  Zachary Yan    3      M    94566  4088182221
2     Tina Luo   39      F    94566  4088283779
3    Haibo Yan   44      M    94566   925351581
4     Ruby Yan   18      F    95054   925351581

In [4]:
type(pd_data)

pandas.core.frame.DataFrame

In [5]:
pd_data.head()

          name  age gender  zipcode       phone
0  Tristan Yan    0      M    94566  9253515818
1  Zachary Yan    3      M    94566  4088182221
2     Tina Luo   39      F    94566  4088283779
3    Haibo Yan   44      M    94566   925351581
4     Ruby Yan   18      F    95054   925351581

In [7]:
pd_data.head().name

0    Tristan Yan
1    Zachary Yan
2       Tina Luo
3      Haibo Yan
4       Ruby Yan
Name: name, dtype: object

In [8]:
pd_data.head().loc[:, ['age', 'phone']]

   age       phone
0    0  9253515818
1    3  4088182221
2   39  4088283779
3   44   925351581
4   18   925351581

In [10]:
pd_data_d = pd.DataFrame(pd_data)

In [11]:
pd_data_d

          name  age gender  zipcode       phone
0  Tristan Yan    0      M    94566  9253515818
1  Zachary Yan    3      M    94566  4088182221
2     Tina Luo   39      F    94566  4088283779
3    Haibo Yan   44      M    94566   925351581
4     Ruby Yan   18      F    95054   925351581